tutorials/2206/alkaWEFoam/singleLayerBuild/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     alkaWEFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         8.31;

deltaT          0.0005;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep 	yes;
maxCo 		0.9;
maxDeltaT	0.05;


functions
{

}
// ************************************************************************* //
